DataProcessors/ИнтеграцияHeadHunter.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияHeadHunter</Name>
			<Comment>АПК:58 Устоявшееся имя сайта</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сайт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаркерОбновления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействияМаркераДоступа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСайта</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ИнтеграцияHeadHunter/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция Сайт() Экспорт
	
	Возврат Справочники.ИсточникиИнформацииОКандидатах.HeadHunter;
	
КонецФункции

Функция НовыйМенеджер(Пользователь) Экспорт
	
	Менеджер = Создать();
	
	Менеджер.Сайт = Сайт();
	Менеджер.Пользователь = Пользователь;
	Менеджер.ДанныеСайта = ДанныеСайта();
	
	Возврат Менеджер;
	
КонецФункции

Функция ДанныеСайта() Экспорт
	
	ДанныеСайта = РекрутинговыеСайтыСлужебный.НовыеДанныеСайта();
	
	ДанныеСайта.Имя = Имя();
	ДанныеСайта.ИмяСайта = ИмяСайта();
	ДанныеСайта.Представление = Представление();
	ДанныеСайта.АдресЗапроса = АдресЗапроса();
	ДанныеСайта.ГлавнаяСтраница = ГлавнаяСтраница();
	ДанныеСайта.Логотип = Логотип();
	ДанныеСайта.ПоискОграничиваетсяТарифом = Истина;
	ДанныеСайта.ПодробностиОграниченияПоискаСсылка = "https://hh.ru/article/27029";
	ДанныеСайта.ДоступнаПовторнаяПубликацияВакансий = Ложь;
	ДанныеСайта.ТекстВопросаПоКонтактногоДоступа = ТекстВопросаПоКонтактногоДоступа();
	
	// АПК:1297-выкл Классификаторы, загруженные с сайта. Не локализуется
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Удмуртская Республика", "Республика Удмуртия");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Чувашская Республика", "Чувашская республика");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Карачаево-Черкесская Республика", "Карачаево-Черкесская республика");
	ДанныеСайта.ЗаменяемыеЗначенияКлассификатора.Вставить("Балахт","Балахта");
	// АПК:1297-Вкл
	
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("professional_roles.id", "professional_roles");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("area.id", "areas");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("type.id", "vacancy_type");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("billing_type.id", "vacancy_billing_type");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("site.id", "vacancy_site");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("salary.currency", "currency");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("experience.id", "experience");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("schedule.id", "schedule");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("address.id", "addresses");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("manager.id", "managers");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("department.id", "departments");
	ДанныеСайта.СоответствиеПутиИКлассификатора.Вставить("employment.id", "employment");
	
	ДанныеСайта.ИменаПутейКДаннымВакансии.Вакансия = "name";
	ДанныеСайта.ИменаПутейКДаннымВакансии.Адрес = "alternate_url";
	ДанныеСайта.ИменаПутейКДаннымВакансии.Идентификатор = "id";
	
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.Наименование = "name";
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.ПредполагаемыйДоход = "salary.to";
	ДанныеСайта.ПоляВакансииВПрограммеИНаСайте.Описание = "description";
	
	ДанныеСайта.ИменаСвойствТелефона.КодСтраны = "country";
	ДанныеСайта.ИменаСвойствТелефона.КодГорода = "city";
	ДанныеСайта.ИменаСвойствТелефона.НомерТелефона = "number";
	ДанныеСайта.ИменаСвойствТелефона.Комментарий = "comment";
	
	ДанныеСайта.ШаблоныСтраницСайта.Сайт = Сайт();
	ДанныеСайта.ШаблоныСтраницСайта.Логотип = Логотип();
	ДанныеСайта.ШаблоныСтраницСайта.ГлавнаяСтраница = ГлавнаяСтраница();
	ДанныеСайта.ШаблоныСтраницСайта.ШаблонURLРезюме = "https://*.hh.ru/resume/*";
	ДанныеСайта.ШаблоныСтраницСайта.РегулярноеВыражениеURLСайта = "https:\/\/((.*?\.hh)|(hh))\.ru\/.*"; // сайт вида http://hh.ru или http://nn.hh.ru
	ДанныеСайта.ШаблоныСтраницСайта.РегулярноеВыражениеURLРезюме = "https:\/\/((.*?\.hh)|(hh))\.ru\/resume\/.*";
	
	ИдентификаторПриложения = ЗарплатаКадрыРасширенный.ИдентификацияПриложенияДляHeadHunter();
	АдресАвторизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1?response_type=code&client_id=%2&redirect_uri=%3",
				ИдентификаторПриложения.auth_uri,
				ИдентификаторПриложения.client_id,
				ИдентификаторПриложения.redirect_uri);
	ДанныеСайта.АдресАвторизации = АдресАвторизации;
	
	ЗаполнитьПараметрыФорм(ДанныеСайта);
	
	Возврат ДанныеСайта;
	
КонецФункции

#Область Интерфейс

// Параметры:
//  АдресаСайтов - Массив Из см. РекрутинговыеСайтыСлужебный.ОписаниеАдресаРекрутинговогоСайта
Процедура ПриЗаполненииАдресовРекрутинговыхСайтов(АдресаСайтов) Экспорт
	
	АдресаСайтов.Добавить(
		РекрутинговыеСайтыСлужебный.ОписаниеАдресаРекрутинговогоСайта(Представление(), АдресЗапроса()));
	
КонецПроцедуры

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияHeadHunter -
//  ПараметрыПодключения - Структура: См. РекрутинговыеСайтыКлиент.НовыеПараметрыПодключения
// 
// Возвращаемое значение:
//  Структура - см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция Подключить(МенеджерСайта, ПараметрыПодключения) Экспорт
	
	Возврат МенеджерСайта.Подключить(ПараметрыПодключения.КодАвторизации);
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияHeadHunter -
// 
// Возвращаемое значение:
//  Структура - см. РекрутинговыеСайтыСлужебный.НовыеРеквизитыСайта
Функция ПроверитьПодключение(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ПроверитьПодключение();
	
КонецФункции

// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияHeadHunter -
// 
// Возвращаемое значение:
//  ФиксированнаяСтруктура
Функция ЗагрузитьКлассификаторы(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ЗагрузитьКлассификаторы();
	
КонецФункции

// Найти кандидатов.
// 
// Параметры:
//  МенеджерСайта - ОбработкаОбъект.ИнтеграцияHeadHunter -
//  ТаблицаНайденныхКандидатов - 
// Таблица найденных кандидатов
//  СтруктураОтбора - 
// Структура отбора
//  ПараметрыПоиска - 
// Параметры поиска
Процедура НайтиКандидатов(МенеджерСайта, ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска) Экспорт
	
	МенеджерСайта.НайтиКандидатов(ТаблицаНайденныхКандидатов, СтруктураОтбора, ПараметрыПоиска);
		
КонецПроцедуры

Функция СайтДоступен(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.СайтДоступен();
	
КонецФункции

Функция ИдентификаторРезюмеПоАдресу(МенеджерСайта, Знач АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.ИдентификаторРезюмеПоАдресу(АдресРезюме);
	
КонецФункции

Функция ДанныеКандидатаПоРезюмеССайта(МенеджерСайта, ИдентификаторРезюме) Экспорт
	
	Возврат МенеджерСайта.ДанныеКандидатаПоРезюмеССайта(ИдентификаторРезюме);
	
КонецФункции

Функция СтруктураРезюмеССайта(МенеджерСайта, ИдентификаторРезюме) Экспорт
	
	Возврат МенеджерСайта.СтруктураРезюмеССайта(ИдентификаторРезюме);
	
КонецФункции

Функция ЭлементКлассификатора(МенеджерСайта, ИмяСписка, Значение) Экспорт
	
	Возврат МенеджерСайта.ЭлементКлассификатора(ИмяСписка, Значение);
	
КонецФункции

Функция ИнформацияОПользователе(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ИнформацияОПользователе();
	
КонецФункции

Функция ПоискДоступен(МенеджерСайта) Экспорт
	
	Возврат МенеджерСайта.ПоискДоступен();
	
КонецФункции

Функция ВакансииССайта(МенеджерСайта, БылиОшибки) Экспорт
	
	Возврат МенеджерСайта.ВакансииССайта(БылиОшибки);
	
КонецФункции

Функция ЗначениеРеквизитаПубликацииПоУмолчанию(МенеджерСайта, Вакансия, Реквизит) Экспорт
	
	Возврат МенеджерСайта.ЗначениеРеквизитаПубликацииПоУмолчанию(Вакансия, Реквизит);
	
КонецФункции

Процедура ЗаполнитьДеревоВакансии(МенеджерСайта, Вакансия, Дерево, СтруктураВакансииССайта) Экспорт
	
	МенеджерСайта.ЗаполнитьДеревоВакансии(Вакансия, Дерево, СтруктураВакансииССайта);
	
КонецПроцедуры

Функция ВидыПолей(МенеджерСайта, ОбновлениеПубликации) Экспорт
	
	Возврат МенеджерСайта.ВидыПолей(ОбновлениеПубликации);
	
КонецФункции

Функция СписокВыбораПоКлассификатору(МенеджерСайта, Путь) Экспорт
	
	Возврат МенеджерСайта.СписокВыбораПоКлассификатору(Путь);
	
КонецФункции

Процедура ПолучитьОтклики(МенеджерСайта, Вакансия) Экспорт
	
	МенеджерСайта.ПолучитьОтклики(Вакансия);
	
КонецПроцедуры

Функция ПоляВакансии(МенеджерСайта, ОбновлениеПубликации = Ложь, ПовторнаяПубликация = Ложь) Экспорт
	
	Возврат МенеджерСайта.ПоляВакансии(ОбновлениеПубликации);
	
КонецФункции

Функция АдресВакансии(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.АдресВакансии(ИдентификаторВакансии);
	
КонецФункции

Функция ОпубликоватьВакансию(МенеджерСайта, Дерево) Экспорт
	
	Возврат МенеджерСайта.ОпубликоватьВакансию(Дерево);
	
КонецФункции

Функция ОбновитьПубликациюВакансии(МенеджерСайта, Дерево, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.ОбновитьПубликациюВакансии(Дерево, ИдентификаторВакансии);
	
КонецФункции

Функция СнятьПубликациюВакансии(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.СнятьПубликациюВакансии(ИдентификаторВакансии);
	
КонецФункции

Функция СвойстваПубликацииВакансииНаСайте(МенеджерСайта, ИдентификаторВакансии) Экспорт
	
	Возврат МенеджерСайта.СвойстваПубликацииВакансииНаСайте(ИдентификаторВакансии);
	
КонецФункции

Процедура ЗагрузитьКомментарииКандидата(МенеджерСайта, Кандидат, ДанныеРезюме) Экспорт
	
	МенеджерСайта.ЗагрузитьКомментарииКандидата(Кандидат, ДанныеРезюме);
	
КонецПроцедуры

Функция ЗаполнитьДеревоКлассификатора(МенеджерСайта, Классификатор, Дерево) Экспорт
	
	Возврат МенеджерСайта.ЗаполнитьДеревоКлассификатора(Классификатор, Дерево);
	
КонецФункции

Функция ДоступныеДляПолученияКонтакты(МенеджерСайта, АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.ДоступныеДляПолученияКонтакты(АдресРезюме);
	
КонецФункции

Функция КонтактыРезюме(МенеджерСайта, АдресРезюме) Экспорт
	
	Возврат МенеджерСайта.КонтактыРезюме(АдресРезюме);
	
КонецФункции

Функция УточнитьОписаниеОшибки(МенеджерСайта, КодСостояния, ОписаниеОшибки) Экспорт
	
	Возврат МенеджерСайта.УточнитьОписаниеОшибки(КодСостояния, ОписаниеОшибки);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Имя()
	
	Возврат "HeadHunter";
	
КонецФункции

Функция ИмяСайта()
	
	Возврат "hh.ru";
	
КонецФункции

Функция Представление()
	
	Возврат НСтр("ru = 'hh.ru'");
	
КонецФункции

Функция АдресЗапроса()
	
	Возврат "api.hh.ru";
	
КонецФункции

Функция ГлавнаяСтраница()
	
	Возврат "https://hh.ru/";
	
КонецФункции

Функция Логотип()
	
	Возврат БиблиотекаКартинок.HeadHunter;
	
КонецФункции

Функция ТекстВопросаПоКонтактногоДоступа()
	
	Возврат НСтр("ru = 'Доступ к контактам резюме HeadHunter платный.
				|Подробности на сайте hh.ru (https://hh.ru/article/27029).'");
	
КонецФункции

Процедура ЗаполнитьПараметрыФорм(ДанныеСайта)
	
	ДанныеСайта.ПараметрыФорм.НастройкаДоступа.ВыводитьКодАвторизации = Истина;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
